{"overall": 1.0, "verified": true, "reviewTime": "05 30, 2017", "reviewerID": "A1GH53UK8XG8JD", "asin": "B00KQV8SWA", "reviewerName": "Vince", "reviewText": "fgnfn", "summary": "One Star", "unixReviewTime": 1496102400}
{"overall": 1.0, "verified": true, "reviewTime": "11 30, 2017", "reviewerID": "A2DKUVUY6M48YF", "asin": "B00KQV8DJ8", "reviewerName": "Shilo Agee", "reviewText": "Was not what I expected", "summary": "One Star", "unixReviewTime": 1512000000}
{"overall": 5.0, "verified": true, "reviewTime": "07 2, 2018", "reviewerID": "A24ET4BPOVKRHJ", "asin": "B00L13X6QA", "reviewerName": "Amazon Customer", "reviewText": "Just as advertised !", "summary": "Five Stars", "unixReviewTime": 1530489600}
{"overall": 4.0, "verified": true, "reviewTime": "01 17, 2018", "reviewerID": "A3K0MNJHO7R2MG", "asin": "B00LYYMXB0", "style": {"Platform:": " PC"}, "reviewerName": "Raymond Ozanne", "reviewText": "Old Version.  Already updated to new version.", "summary": "old version", "unixReviewTime": 1516147200}
{"overall": 2.0, "verified": true, "reviewTime": "01 5, 2018", "reviewerID": "A1VUA80DLZGWIP", "asin": "B00MCLGAAO", "style": {"Platform:": " PC Disc"}, "reviewerName": "furfoot", "reviewText": "A giant mess of a product but I use it for the point of sale credit card processing.", "summary": "Overpriced and buggy as hell but it mostly works.", "unixReviewTime": 1515110400}
{"overall": 5.0, "verified": true, "reviewTime": "10 19, 2017", "reviewerID": "A17BKFKKUZ8VAT", "asin": "B00MHZ71G2", "style": {"Platform:": " PC/Mac/Mobile Download Code"}, "reviewerName": "Ronald Moore", "reviewText": "Great product", "summary": "Five Stars", "unixReviewTime": 1508371200}
{"overall": 5.0, "verified": true, "reviewTime": "11 4, 2017", "reviewerID": "A10EIJM2C94M14", "asin": "B00MHZ6VHM", "style": {"Platform:": " PC/Mac/Mobile Download Code"}, "reviewerName": "M.Smith", "reviewText": "item as seller described", "summary": "Five Stars", "unixReviewTime": 1509753600}
{"overall": 4.0, "verified": true, "reviewTime": "12 15, 2016", "reviewerID": "A2A4DPHP8DCVDY", "asin": "B00MUTAY1Y", "style": {"Platform:": " PC Key Card"}, "reviewerName": "cat sadler", "reviewText": "I like lifesafe, they are more like Norton, but cheaper. have used it for 2 yrs now", "summary": "Four Stars", "unixReviewTime": 1481760000}
{"overall": 5.0, "verified": true, "reviewTime": "10 19, 2017", "reviewerID": "A17BKFKKUZ8VAT", "asin": "B00MYXUBVE", "reviewerName": "Ronald Moore", "reviewText": "Great product", "summary": "Five Stars", "unixReviewTime": 1508371200}
{"overall": 2.0, "verified": false, "reviewTime": "10 20, 2015", "reviewerID": "A27E44IWS3B7VD", "asin": "B00MYXUBVE", "reviewerName": "silhouette_of_enchantment", "reviewText": "Disappointed with this version of Turbo Tax, and had to end up going to a tax professional to have my return done. Why would I need to spend $40 for the deluxe version of Turbo Tax in order to get my tax return done? I think Turbo Tax needs to be upfront about what features you'll get with the basic versus the deluxe. I always use the 1040EZ to file my taxes.  I'd rather spend the extra couple of dollars to get the features included with the deluxe version than waste money. Luckily, I got this software to try out.", "summary": "Buyer Beware", "unixReviewTime": 1445299200}
{"overall": 5.0, "verified": true, "reviewTime": "12 2, 2017", "reviewerID": "A1DSGNHMAGNLTZ", "asin": "B00MYXTCGY", "style": {"Platform:": " PC/Mac Disc"}, "reviewerName": "P. Barrett", "reviewText": "Turbo Tax best software I have found", "summary": "Five Stars", "unixReviewTime": 1512172800}
{"overall": 3.0, "verified": true, "reviewTime": "05 4, 2016", "reviewerID": "AFJUSRQTNHJ5I", "asin": "B00MYXTCMI", "reviewerName": "Digger", "reviewText": "Still a bit buggy, but improved over previous years.", "summary": "Three Stars", "unixReviewTime": 1462320000}
{"overall": 5.0, "verified": true, "reviewTime": "02 3, 2016", "reviewerID": "A3RVG0QUY7R7LX", "asin": "B00MYXTCMI", "reviewerName": "G&#039;Wood", "reviewText": "The price was less than purchasing it direct from Intuit.", "summary": "IRS Taken Care Of", "unixReviewTime": 1454457600}
{"overall": 5.0, "verified": true, "reviewTime": "11 4, 2017", "reviewerID": "A10EIJM2C94M14", "asin": "B00N9MUV96", "style": {"Platform:": " PC Online Code"}, "reviewerName": "M.Smith", "reviewText": "item as seller described", "summary": "Five Stars", "unixReviewTime": 1509753600}
{"overall": 5.0, "verified": true, "reviewTime": "04 6, 2018", "reviewerID": "A2ONJRZVX2MLVE", "asin": "B00NG7K2RA", "style": {"Platform:": " PC Download"}, "reviewerName": "Angela-Clare Pollard", "reviewText": "Easy to file your taxes correctly.", "summary": "Five Stars", "unixReviewTime": 1522972800}
{"overall": 5.0, "verified": true, "reviewTime": "04 6, 2018", "reviewerID": "A2ONJRZVX2MLVE", "asin": "B00NG7JYYM", "style": {"Platform:": " PC Download"}, "reviewerName": "Angela-Clare Pollard", "reviewText": "Easy to file your taxes correctly.", "summary": "Five Stars", "unixReviewTime": 1522972800}
{"overall": 5.0, "verified": true, "reviewTime": "04 6, 2018", "reviewerID": "A2ONJRZVX2MLVE", "asin": "B00NG7JQHW", "style": {"Platform:": " PC Download"}, "reviewerName": "Angela-Clare Pollard", "reviewText": "Easy to file your taxes correctly.", "summary": "Five Stars", "unixReviewTime": 1522972800}
{"overall": 4.0, "verified": true, "reviewTime": "01 13, 2018", "reviewerID": "AY7Z0W9EKBCBB", "asin": "B00NKY4ZCC", "reviewerName": "Tina Musto", "reviewText": "good temporary,quick security. ladygamblertina@yahoo.com", "summary": "Four Stars", "unixReviewTime": 1515801600}
{"overall": 5.0, "verified": true, "reviewTime": "12 25, 2017", "reviewerID": "A3LDWKMHWW3OXN", "asin": "B00NKY4ZCC", "reviewerName": "ROGER ALLEN", "reviewText": "thank you for a excellent product", "summary": "Five Stars", "unixReviewTime": 1514160000}
{"overall": 5.0, "verified": true, "reviewTime": "05 22, 2017", "reviewerID": "A19E8HMVYC7MO5", "asin": "B00NKY4ZCC", "reviewerName": "Dan Rancier", "reviewText": "Really works well.", "summary": "Must Have", "unixReviewTime": 1495411200}
{"overall": 3.0, "verified": true, "reviewTime": "11 25, 2016", "reviewerID": "AID7YAXYMK4KT", "asin": "B00NKY4ZCC", "reviewerName": "Angel Nguyen", "reviewText": "Didn't work well with other products.", "summary": "Three Stars", "unixReviewTime": 1480032000}
{"overall": 3.0, "verified": false, "reviewTime": "12 16, 2014", "reviewerID": "A3S5WYWYKSAI9C", "asin": "B00O2KAI2Y", "reviewerName": "Bradley Olin", "reviewText": "My almost 5 year old does not really get a whole lot of independent screen time at the computer.  We tried to introduce her to the software on our laptop and she just kind of got bored with it.  We tried switching to the app for Ipad, which she is more comfortable with, but it is not linking up with the software profile we created...it seems more like an add on than a supplement to the reading program on the computer based tool.  I guess I had better hopes for something that would really be instrumental to helping her learn to read, but it's been kind of a bust so far.", "summary": "If your child isn't already using a computer, forget it", "unixReviewTime": 1418688000}
{"overall": 3.0, "verified": false, "reviewTime": "12 11, 2014", "reviewerID": "A3JRW716H3AX14", "asin": "B00O2KAI2Y", "reviewerName": "Scott Lloyd", "reviewText": "While the basic idea might be good for many kids the business modelan online subscriptionis wrong. I can't really see why anyone would want to keep this service unless you just had a lot of money to burn. Perhaps grandparents with lots of disposable income will find it acceptable.\n\nI give it three stars because the basic program works although I would not consider it stellar by any means. There are lots of repetitive aspects that will surely annoy most adults. A lot of the graphics seem generic as if not a lot of love went into the program's creation.", "summary": "Wrong business model", "unixReviewTime": 1418256000}
{"overall": 5.0, "vote": "5", "verified": false, "reviewTime": "12 24, 2014", "reviewerID": "A2R95Z7PTF5ZRO", "asin": "B00O66FYU0", "reviewerName": "AmazonFan", "reviewText": "Long gone are the days when personal technology consisted of a desktop computer and clamshell flip phone. I realize there are a lot of naysayers about Adobe's shift to subscription based services but I am in the camp that appreciates the ability to access, edit and share my files on the go from multiple devices without having to purchase multiple licenses.\nAs for the Adobe Creative Cloud plan, initial set up was easy and accessing files from different devices has worked smoothly. If you are already familiar with Photoshop and/or Lightroom, then CC will be intuitive to use.\nI am moderate in my skills and found the online tutorials very helpful.\nAs with any new software, expect to spend some time navigating all the features and advanced techniques available.\n\nFrom Microsoft to Norton Security, many companies are shifting to subscription based services. But not all are worth it.\nWith Adobe CC, the industry's best photo editing software is now available to many who would not otherwise be able to afford it.\nIf you are a multi-device user - laptop, tablet, smartphone - Adobe Creative Cloud is actually a very good value and at least worth a try.\nIt also makes a great gift for anyone looking to become proficient in Photoshop for job hunting purposes.", "summary": "Don't look back", "unixReviewTime": 1419379200}
{"overall": 5.0, "verified": false, "reviewTime": "12 15, 2014", "reviewerID": "A2Z1R98M2XOCEJ", "asin": "B00O66FYU0", "reviewerName": "Harold G. Meeks Jr.", "reviewText": "Adobe's Creative Cloud Photography plan combines two powerful digital image tools which compliment each other well. Photoshop is an industry standard application for image editing, creative manipulation, compositing and much more. Lightroom is a tool focused on working with digital photographs; cataloging, editing and image enhancement.\n\nOver a year ago Adobe implemented their new business model for their creative tools. Instead of selling licenses for their products outright, they went to a subscription model for the majority of their software products. You can choose to pay on a month by month basis for the tools you use, choose a bundle (such as the Photography Plan) or all the tools at once. By paying for a year at a time, the costs can be lowered, and there is an educational discount as well. This decision made for a lot of unhappy users who were used to perpetual licenses. There is some upside though; users benefit from major releases without having to buy the software all over again. Students can actually afford the software for a semester's worth of work. Adobe is able to leverage the connected aspects of Creative Cloud applications for such things as sharing content.\n\nPhotoshop is the industry standard software for image work, specifically raster based (as opposed to vector based, which is Illustrator's specialty). This includes common image formats such as jpeg, gif, RAW, png, TIFF, PSD (photoshop's native format). It can even import video. For this release (CC 2014) Adobe wisely chose to not change the look and feel of the software from CS 6. It has the familiar white on dark color scheme. All the tools and menus are pretty much as they have always been. This is good news for long time users.\n\nFor those getting started, Photoshop can be a little daunting. Fortunately, there are many resources available in book and online form to help, including Adobe's own excellent videos. The tool set is quite deep. There are drawing tools, there is the type tool and extremely powerful selection tools. Need to separate an object from it's background? There are several ways to do it, and these can be combined. Need to remove an object? Photoshop can pull a magic trick with it's content aware fill tool. It was good in CS 6, and it is improved further in Photoshop CC 2014. As has been always the case, Photoshop's use of layers is an essential feature - allowing for compositing, layering, mattes, layer operations. An extensive list of creative filters are at an artists disposal. There are users who spend years with Photoshop and are still learning new ways to use the software.\n\nCC 2014 is an incremental release over CS 6. As has already been said, one would be hard pressed to spot a difference between it and CS 6 just by looking at the screen layout. The differences show up when you dig into the menus. Blur Gallery Motion Effects adds a lot of depth. Upscaling of images has improved. A better Perspective warp. A camera shake reduction that actually works (but still, don't expect miracles for truly bad photos). Creative Cloud Library integration for group work projects.  Photohop CC 2014's 3D tools are even better - now supports 3D printers.  Is it enough for those hanging on to their copies of CS 6 to upgrade? My rule of thumb in years past was to alternate releases. I went from CS 4 to CS 6. CC 2014 feels almost like a CS 7.5.\n\nLightroom is Adobe's tool for Photography management and creative work. It has always been a good tool that has steadily improved. It's closest competitor was Apple's Aperture, which Apple has announced is now end of life - to be replaced with a new application called Photos. Adobe has capitalized on this period of uncertainty by offering a tool to import Aperture libraries into Lightroom.\n\nLightroom's workflow is to import images, either singly or folders at a time. Editing is non-destructive; the original images are left alone. Once images are imported into a library, the user goes to the \"Develop\" panel to apply image adjustments such as color correction, curves and lens corrections (such as correcting for distortion from a wide angle lens). Tools include spot removal, graduated and radial filters and the adjustment brush (allowing for selective tonality adjustments). Extensive export options are supported, including creating photo books (either as PDF or sent to Blurb), slideshows and Web galleries. The last option is very nicely done, with a fair amount of flexibility in layout including output types (such as Flash or HTML).\n\nFor those who are either professional photographers or dedicated amateurs, Lightroom is an excellent tool to have. It should be noted that unlike Photoshop CC, Lightroom can either be \"rented\" through the Creative Cloud, or purchased outright. It is one of the few products left that Adobe sells a license for (Photoshop Elements and Premiere Elements are two others that come to mind).\n\nBoth of these tools together represent a fully realized workflow for creative image work. Lightroom handles importing images, cataloging them, adjustments and output. Photoshop adds an extremely powerful creative tool for working with those images combined with other sources. While there are other options, including the free GIMP, both represent the industry standard. For any one interested in graphic design or photographic work, they are near essential.", "summary": "Pretty much essential for graphics professionals", "unixReviewTime": 1418601600}
{"overall": 5.0, "verified": false, "reviewTime": "12 15, 2014", "reviewerID": "A2W1MMTI4BNJKD", "asin": "B00O66FYU0", "reviewerName": "Amazon Customer", "reviewText": "I am a avid photographer with many cameras and photos.  My camera gear is very important to my creative work, and Adobe Creative Cloud is just as important as my other photography gear.  This package is where the magic to great photos take place.  Yes, it is important to start with good images, but to make them go beyond your regular snap shots to photo art you need this Adobe package, Ps and Pr.\n\nThis package is easy to install and have working in a very short time.  There are tons of Youtube videos explaining out best to use this package.  Amazon also has many books to help you learn the best ways to make use of this software.\n\nI highly recommend this product to anyone which to take their photography to new levels.", "summary": "A Must Have For Any Serous Photographer - Simply The Best!", "unixReviewTime": 1418601600}
{"overall": 5.0, "verified": true, "reviewTime": "12 23, 2016", "reviewerID": "A3IO7P02I0IIEM", "asin": "B00OMQLT6C", "reviewerName": "GMD", "reviewText": "works well", "summary": "Five Stars", "unixReviewTime": 1482451200}
{"overall": 5.0, "verified": true, "reviewTime": "02 26, 2018", "reviewerID": "A3PGN4ZXMQRSYH", "asin": "B00OSE74RG", "style": {"Platform:": " PC Download"}, "reviewerName": "Amazon Customer", "reviewText": "Arrived as described.  I was pleased with purchase", "summary": "I was pleased with", "unixReviewTime": 1519603200}
{"overall": 2.0, "verified": true, "reviewTime": "04 19, 2018", "reviewerID": "A24DO6K2FU92YH", "asin": "B00OSDY8PI", "style": {"Platform:": " PC Download"}, "reviewerName": "Robert Richmond", "reviewText": "It did not work", "summary": "Forget It", "unixReviewTime": 1524096000}
{"overall": 4.0, "verified": true, "reviewTime": "01 13, 2018", "reviewerID": "AY7Z0W9EKBCBB", "asin": "B00OSDY8PI", "style": {"Platform:": " PC Download"}, "reviewerName": "Tina Musto", "reviewText": "a good product for school. ladygamblertina@yahoo.com", "summary": "Four Stars", "unixReviewTime": 1515801600}
{"overall": 1.0, "verified": true, "reviewTime": "05 16, 2018", "reviewerID": "A24DO6K2FU92YH", "asin": "B00P31G9PQ", "reviewerName": "Robert Richmond", "reviewText": "It did not work.", "summary": "It did not work", "unixReviewTime": 1526428800}
{"overall": 3.0, "verified": true, "reviewTime": "10 15, 2016", "reviewerID": "A2NSXY5L42ZUGO", "asin": "B00P6U8C5Y", "style": {"Platform:": " PC/Mac Disc"}, "reviewerName": "R G", "reviewText": "Worked", "summary": "OK", "unixReviewTime": 1476489600}
{"overall": 2.0, "verified": true, "reviewTime": "04 22, 2016", "reviewerID": "A1A9WJHKBSTI4C", "asin": "B00PG8FSYE", "reviewerName": "William", "reviewText": "Works...that's all I can say about it. VERY non-intuitive. Help is barely adequate.\nDarn right UGLY, spartan interface.\n\nBack to Turbo Tax!", "summary": "UGH!", "unixReviewTime": 1461283200}
{"overall": 5.0, "verified": true, "reviewTime": "06 28, 2018", "reviewerID": "A34AN3NF8P7PJ", "asin": "B00PT6GQY4", "style": {"Platform:": " PC Download"}, "reviewerName": "Reatha Carey", "reviewText": "Useful for me when I am on a tight budget", "summary": "Five Stars", "unixReviewTime": 1530144000}
{"overall": 5.0, "verified": true, "reviewTime": "05 16, 2018", "reviewerID": "A24DO6K2FU92YH", "asin": "B00PT6GQY4", "style": {"Platform:": " PC Download"}, "reviewerName": "Robert Richmond", "reviewText": "A good second fiddle for Microsoft Office.", "summary": "A good second fiddle for Microsoft Office", "unixReviewTime": 1526428800}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "12 1, 2017", "reviewerID": "AOOWG6KYD32UJ", "asin": "B00PT6GQY4", "style": {"Platform:": " PC Download"}, "reviewerName": "Harold Pont", "reviewText": "This is a great program that can be downloaded from LibreOffice.org and a compatible program that is just as free can be downloaded from OpenOffice.org  If you want this program, you can get the updated version from LibreOffice.org  This is version 4.3 and the one from LibreOffice.org is already 5.0", "summary": "This is old version, and the new one is availale at LibreOffice.org for free.", "unixReviewTime": 1512086400}
{"overall": 5.0, "verified": true, "reviewTime": "02 26, 2018", "reviewerID": "A3PGN4ZXMQRSYH", "asin": "B00RKZKFUI", "reviewerName": "Amazon Customer", "reviewText": "ItemArrived as described.  I was pleased with purchase", "summary": "I was pleased with", "unixReviewTime": 1519603200}
{"overall": 5.0, "verified": true, "reviewTime": "01 31, 2018", "reviewerID": "A377FI7BV0X32K", "asin": "B00SOJ3GMS", "reviewerName": "William Cashion", "reviewText": "this software works", "summary": "Five Stars", "unixReviewTime": 1517356800}
{"overall": 5.0, "verified": true, "reviewTime": "11 4, 2017", "reviewerID": "A1MOLMEBRO23PR", "asin": "B00SOJ3GMS", "reviewerName": "Daniel Young", "reviewText": "A++", "summary": "Five Stars", "unixReviewTime": 1509753600}
{"overall": 1.0, "verified": true, "reviewTime": "11 4, 2017", "reviewerID": "A1MOLMEBRO23PR", "asin": "B00SWCP8CI", "reviewerName": "Daniel Young", "reviewText": "ya", "summary": "One Star", "unixReviewTime": 1509753600}
{"overall": 1.0, "verified": true, "reviewTime": "06 2, 2017", "reviewerID": "A2PQL2RCDDVZN6", "asin": "B00SWCP8CI", "reviewerName": "Timnukes", "reviewText": "NOT GOOD", "summary": "One Star", "unixReviewTime": 1496361600}
{"overall": 5.0, "verified": true, "reviewTime": "05 16, 2018", "reviewerID": "A24DO6K2FU92YH", "asin": "B00TKUEGCY", "style": {"Platform:": " PC Download"}, "reviewerName": "Robert Richmond", "reviewText": "Great, except I could have downloaded it from adobe.com", "summary": "Five Stars", "unixReviewTime": 1526428800}
{"overall": 1.0, "verified": true, "reviewTime": "04 19, 2018", "reviewerID": "A24DO6K2FU92YH", "asin": "B00TRAR53E", "style": {"Platform:": " PC Download"}, "reviewerName": "Robert Richmond", "reviewText": "It was the free copy you can download from adobe.com.", "summary": "One Star", "unixReviewTime": 1524096000}
{"overall": 4.0, "vote": "4", "verified": true, "reviewTime": "11 6, 2017", "reviewerID": "AT4I0AOR9YLNK", "asin": "B00U3H6626", "reviewerName": "Russ G.", "reviewText": "There are a couple things I would like to see such as large files moved to the outside of the drive.  Or files used a lot are in the inside of the drive where it will take the information the fastest.  Give the user more control how the defrag gets done.  I went as far as upgrading and registering the program rather than just using as is.", "summary": "Defrag seems to speed up my computer", "unixReviewTime": 1509926400}
{"overall": 5.0, "verified": true, "reviewTime": "07 2, 2018", "reviewerID": "A24ET4BPOVKRHJ", "asin": "B00U7LCE6A", "reviewerName": "Amazon Customer", "reviewText": "Just as advertised !", "summary": "Five Stars", "unixReviewTime": 1530489600}
{"overall": 1.0, "verified": true, "reviewTime": "04 19, 2018", "reviewerID": "A24DO6K2FU92YH", "asin": "B00UBKB40Y", "reviewerName": "Robert Richmond", "reviewText": "It did not download correctly", "summary": "It Was Corrrupted", "unixReviewTime": 1524096000}
{"overall": 5.0, "verified": true, "reviewTime": "07 18, 2017", "reviewerID": "A1SE0LK82QXOGZ", "asin": "B00UBKB40Y", "reviewerName": "Starfleetguy", "reviewText": "Great", "summary": "Five Stars", "unixReviewTime": 1500336000}
{"overall": 3.0, "verified": true, "reviewTime": "07 15, 2018", "reviewerID": "A3W4D8XOGLWUN5", "asin": "B00UVTEJ7K", "reviewerName": "Michael Kerner", "reviewText": "When it has came up to us, we do have a lot of music and media that we do need to start uploading for digital storage. Especially today, with nearly all of our music coming to our tablets, smartphones from places like ITunes and Google. But for those of us whom have CD's and records that do want to transition them to digital MP3 files, they need a strong burner software, that will help you rip, burn & preserve your favorite music into one place. But finding that kind of software is much easier said than done. Most of us pick the wrong software at the end. When I had heard about this free software called FreeRip, I wanted to see if was as good as other brands, and honestly it isn't as strong. FreeRip MP3 Converter is alright, but doesn't do as strong enough of a job as is the case with media software from companies like Roxio and Adobe. Not only that, but as I was ripping some CD's, it wouldn't recognize the discs as strongly as I thought it would. Overall, I would not recommend this software as strongly as others. You really can find better for the money. It is too bad it isn't here.\n\nPrice: D+\n\nConvenience & Setup: C-\n\nOverall: C-", "summary": "Music Mash-Up?", "unixReviewTime": 1531612800}
{"overall": 5.0, "verified": true, "reviewTime": "02 26, 2018", "reviewerID": "A3PGN4ZXMQRSYH", "asin": "B00UVTEJ7K", "reviewerName": "Amazon Customer", "reviewText": "Arrived as described.  I was pleased with purchase", "summary": "I was pleased with", "unixReviewTime": 1519603200}
{"overall": 5.0, "verified": true, "reviewTime": "01 13, 2018", "reviewerID": "AY7Z0W9EKBCBB", "asin": "B00W8DIFCM", "reviewerName": "Tina Musto", "reviewText": "My daughter likes this software application. ladygamblertina@yahoo.com", "summary": "Five Stars", "unixReviewTime": 1515801600}
{"overall": 5.0, "verified": true, "reviewTime": "07 18, 2017", "reviewerID": "A1SE0LK82QXOGZ", "asin": "B00W8DIFCM", "reviewerName": "Starfleetguy", "reviewText": "Great", "summary": "Five Stars", "unixReviewTime": 1500336000}
{"overall": 1.0, "verified": true, "reviewTime": "11 30, 2017", "reviewerID": "A2DKUVUY6M48YF", "asin": "B00WM5WFEK", "reviewerName": "Shilo Agee", "reviewText": "Was not what I expected", "summary": "Was not what I expected", "unixReviewTime": 1512000000}
{"overall": 1.0, "verified": true, "reviewTime": "04 7, 2017", "reviewerID": "A39SHLNGZSJHNJ", "asin": "B00WM5WFEK", "reviewerName": "Markis Allen", "reviewText": "You get what u pay for!", "summary": "Dont Bother!", "unixReviewTime": 1491523200}
{"overall": 5.0, "verified": true, "reviewTime": "08 26, 2018", "reviewerID": "A2SACTIFMC5DXO", "asin": "B01019TDJ8", "reviewerName": "Thomas", "reviewText": "Can use over on new builds after your done using your last build w/o going to MS", "summary": "Great Stuff", "unixReviewTime": 1535241600}
{"overall": 4.0, "verified": true, "reviewTime": "04 19, 2018", "reviewerID": "A33IUIT8G4MA4N", "asin": "B010P91LYY", "style": {"Platform:": " PC/Mac"}, "reviewerName": "Happy Happy Joy Joy", "reviewText": "Happy Happy Joy Joy! It was just as it was advertised, so it gets four stars, what else is there to say! They would get five stars if they went above and beyond what was advertised and expected.\n\nImagine if your grocery store was like this and you had to rate every product you purchased! How annoying would that be?", "summary": "Happy Happy Joy Joy", "unixReviewTime": 1524096000}
{"overall": 5.0, "verified": false, "reviewTime": "04 3, 2018", "reviewerID": "A15KW9UMN29BKO", "asin": "B010P91LYY", "style": {"Platform:": " PC/Mac"}, "reviewerName": "Erik R. Bostrom", "reviewText": "Quick Ship, Good product.", "summary": "Quick Ship, Good product.", "unixReviewTime": 1522713600}
{"overall": 5.0, "verified": true, "reviewTime": "04 25, 2018", "reviewerID": "A10SE0U42ABS9S", "asin": "B011DMUIQY", "style": {"Platform:": " Mac Key Card"}, "reviewerName": "Grant Cummings", "reviewText": "legit key.", "summary": "legit key.", "unixReviewTime": 1524614400}
{"overall": 5.0, "verified": false, "reviewTime": "11 14, 2015", "reviewerID": "A2DA2NJZ2RIYAB", "asin": "B011I737WG", "reviewerName": "Melissa B.", "reviewText": "As a small business owner I needed another way to keep my records straight. Thus software is easy to use and easy to understand. Overall a great item for any business owner", "summary": "Thus software is easy to use and easy to understand", "unixReviewTime": 1447459200}
{"overall": 5.0, "verified": false, "reviewTime": "11 13, 2015", "reviewerID": "A226VGZWOEBPGL", "asin": "B011I737WG", "reviewerName": "Amazon Customer", "reviewText": "Powerful accounting or bookkeeping software for your business. Yearly support services require you to purchase annually and this is trending with what the industry is doing with Office Software and also with accounting software. Quickbooks only supports a few years before it no longer is supported and is essentially obsolete.\n\nSage (formally Peachtree) is a robust and complete set of accounting tools for those that provide services or for those that track inventory (much more complex). The email of invoices is a handy internal tool, but the lack of payroll options outside of an add on is somewhat frustrating.\n\nAll in all, those that are familiar with this software or those that need more robust tools will really appreciate the software, for those that are new, it will have a steep learning curve with productive results.", "summary": "those that need robust accounting tools will really appreciate the software", "unixReviewTime": 1447372800}
{"overall": 5.0, "verified": false, "reviewTime": "11 12, 2015", "reviewerID": "A2LW5AL0KQ9P1M", "asin": "B011I737WG", "reviewerName": "Dr. E", "reviewText": "This is about as perfect as it gets. This is my second year using this software (as opposed to QuickBooks). I loved it the first year I used it and continue to feel likewise with this newest version.\n\nIt is a snap to install, seems \"bug\" free (at least as of right now and following some pretty serious use), and it is incredibly intuitive/easy to use. In fact, the ease of this program is a time-saver for me ... and that means more time with me family. And, that is invaluable!\n\nThis is expertly developed, phenomenally well-tested, and worth every penny!\n\nBravo to Sage for making a product that consumers can truly invest their trust in!", "summary": "Superior to QuickBooks in Every Way ...", "unixReviewTime": 1447286400}
{"overall": 4.0, "verified": false, "reviewTime": "11 12, 2015", "reviewerID": "AZ0PCEZUTF5QO", "asin": "B011I737WG", "reviewerName": "Leah Berk", "reviewText": "To teach myself how to use Sage 50, I relied online tutorials (video and text) for when I got stuck; Youtube has a wealth of intro/beginner/intermediate ones for helping setup and run the program. With an afternoon's focus, I got most of the basic functions implemented and felt comfortable using the software.\n\nThis software is really ideal for a small business or company that needs reliable accounting software, but does not (yet) need an actual accountant or financial person to keep tabs on things. I run a very small business out of my home and occasionally have a friend or partner assist me with the goings-on, and Sage 50 definitely offers the functionality I needed: invoices and statements (looked great, slick, and professionally done), balancing, etc. Premium is more than adequate for a small (<10?) employee business.\n\nA major drawback is taht it's a subscription software, meaning it has planned obsolescence and will require renewal in a year. I'm not sure if I would stick with this (given I received a free copy to review) given its cost, but I'll see how it goes for a year with my small business before deciding to renew/continue. The other major direct competitor is QuickBooks, whose software packages are equally expensive.", "summary": "Great for managing finances in a small business environment, online tutorials are invaluable", "unixReviewTime": 1447286400}
{"overall": 4.0, "verified": false, "reviewTime": "11 6, 2015", "reviewerID": "A1BK60GZ4QME6I", "asin": "B011I737WG", "reviewerName": "John W. Graham", "reviewText": "Sage 50 (formerly Peachtree) brings you best-in-class accounting standards, secure desktop installation, unlimited access to support, plus affordable subscription plans that offer the best value for your business.\n\nFrom the Sage website, \"Your expanding business needs easy-to-use yet powerful accounting, inventory, and reporting functionality. Sage 50 Premium Accounting 2016 provides at-a-glance dashboards and management centers, plus budget and analysis tools to help you make confident decisions. Consolidate multicompany financials, compare multiple budgets, track job change orders, and create custom reports for greater insight. Plus, Sage 50 comes fully supported and includes automatically delivered updates; access to help and advice by phone, chat, email, and online; and customized reporting, all part of an autorenewing Sage Business Care plan. Save time and money and accomplish more every day with Sage 50 Premium Accounting.\"\n\nSage 50 Premium has the basic accounting features found in Sage 50 Pro plus advanced features\nand automation that your expanding business demands.\n\nYou can...\n\nKeep track of on-hands, issue automatic POs when inventory drops, and track performance of products and services.\nBreak large jobs into phases, tracks costs by the phase and cost code, and bill as the job progresses.\nMake better decisions with 100+ reports and financial statements. Create customized Excel reports using real-time Sage 50 data.\n\nSage 50 Premium features:\n\nTabbed Navigation: Everything is easily accessible for your customers, vendors, inventory, and employees. Banking and system information is here too, along with shortcuts to frequent tasks.\nWork Flow: Tasks are organized by work flow, and you can link to individual tasks under each icon.\nCustomers:  See a list of all your customers and their information and quickly drill-down to the details.\nRecent Reports:  Easily access your top reports and view your aged receivables in graph or table form.\nSage Advice: Get the most out of your investment with tutorials, on-screen advice and downloadable guides, along with One-click Support Chat when you need it.\nCustomers & Sales Tasks: Create a sales invoice for products and services your customers purchase from you. You can also view, edit and print invoices, bill for time and expenses, or save the invoice for repeat sales.\nCustomize, print, email, copy: You can customize the layout; print or email the invoice; or copy and send to multiple customers -- all from the menu bar.\nView credit limit status: Make sure the customer is in good standing. Customize terms for each customer and get notifications when credit limit is exceeded.\nRecord payments or deposits: You can even process credit card sales with Sages integrated payment solution.\nSelect a bill to pay: You can also view and edit paid bills, write a check, pay multiple bills, or save the payment information for recurring bills.\nChoose which bills to pay: Pay all, pay some, or only pay a portion of the total and Sage 50 Accounting will calculate the amount and apply it to the bill(s).\nTime Frame: Project cash flow from 7 days to 12 months out.\nCrunch Numbers: Adjust numbers and run what if scenarios without affecting actual Sage 50 data.\nChange settings: Modify settings for accurate projections based on transaction history.\nVisualize your data: The summary totals and graph provide a quick view of your cash flow as you make adjustments to projected balances, incoming or outgoing cash.\nSee how well your business is doing overall: Design and customize your financial statements with tools on the menu bar, then print, email or create a PDF to distribute to others.\nFinancial Statement Wizard: The Financial Statement Wizard walks you through creating your own custom financial statement.\n\nSage 50 Premium has these advantages over the Pro version:\n\nAdvanced Budgeting\nArchive Company Data\nAudit Trail\nChange Order Processing\nCompany Consolidation Wizard\nCustomer Management Center\nDepartmentalized Financial Statements\nInventory & Services Management Center\nJob Costing - Phase and Cost Level\nOpen Multiple Companies\nSerialized Inventory\nStreamlined Service Billing\nView Transaction History\nVendor Management Center\n\nYour purchase includes:\n\nUnlimited access to support.\nAutomatically delivered updates.\nFreedom to select users, payment options and add-ons that are right for your business.\nYour information is always available, your files always accessible.\nEasier and more flexible than buying software the old fashioned way.\nCredit card processing inside your software with Sage Payment Solutions.\nMore ways to get paid with electronic checks and more through the Sage Payment Management System.\nIncrease sales with the Sage Mobile Sales app that lets you book sales anywhere, anytime\n\nThe system requirements for Sage 50 Premium 2016 are (minimum):\n\n2.0 GHz processor for single user and multiple users\n1 GB of RAM for single user and multiple users\nWindows Vista SP2, Windows 7, or Windows 8, with the latest updates from Microsoft installed\n1 GB of disk space for installation\nInternet Explorer 9.0, 10.0, and 11.0 supported\nMicrosoft. NET Framework 4.5.2; requires an additional 280 MB to 610 MB\nAt least high-color (16-bit) SVGA video; supports 1024x768 resolution with small fonts required\nDVD-ROM\nAll online features/services require Internet access\nExcel, Outlook, and Word integration requires Microsoft Excel, Outlook, and Word 2007, 2010, or 2013 (32-bit)\nPrinters supported by Microsoft Vista, Windows 7, or Windows 8\nIn-product demos require Adobe Flash Player 10 or greater\nAdobe Reader 9.0 required\nMultiuser environments are supported in Sage 50 Premium Accounting and higher\nMultiuser mode is optimized for Windows Server 2008 or Windows Server 2012 client-server networks, and Windows Vista, Windows 7, or Windows 8 peer-to-peer networks\nA maximum of five licensed named users is allowed for Sage 50 Premium Accounting and 40 named users for Sage 50 Quantum Accounting; a named user account is granted a license when selected in the user maintenance screen\n1 GB of disk space for installation of components on server\nWindows Server 2008, or Windows Server 2012 along with Remote Desktop Connection or Remote Desktop Web Connection client is required to run in a Windows Terminal Services environment; no more than 5 named users for Sage 50 Premium Accounting or 40 named users for Sage 50 Quantum Accounting\nTerminal Server requires additional memory when more than one user is running under Windows Terminal Services\nCustomer registration and acceptance of License Agreement for Sage 50 Accounting software products\n\nRecommended:\n\n2.4 GHz processor for single user and multiple users\n1 GB of RAM for single user and 2 GB for multiple users\n\nMicrosoft Windows XP and Server 2003 are not supported\n\nIn terms of installation, you can install on a single computer or a workstation/server on a network.\nYou will need local administrative rights to perform the install.  You will need unrestricted system access during the install.\nYou should also disable your AV software during the install.\nSage 50 will auto-configure a Windows Firewall protected system.\nInstallation is as easy as following on-screen prompts and there are online installation tips and how-to's for server installation.\n\nI am a former Peachtree user, so a lot of Sage 50's features are familiar.  I would personally be OK with the Pro version as I don't use many of the features of Premium, nor do I really need a 3-user license scheme.\n\nOne thing that would be nice to include with this is Payroll but this has to be added at an additional cost.\nNote that built in support and product updates are only good for 365 days.\n\nOverall - I don't like subscription schemes but I do think this is powerful and well-designed software.", "summary": "Offers some features beyond the pro version", "unixReviewTime": 1446768000}
{"overall": 4.0, "verified": false, "reviewTime": "11 5, 2015", "reviewerID": "A2FBPS1P12N24T", "asin": "B011I737WG", "reviewerName": "Medianvalued", "reviewText": "This is Peachtree accounting renamed as Sage.  It has some nice features - actually nicer than those in QuickBooks but you pay a price for the nicer features - much of this has to be renewed by subscription each year.  You can export data to and from Excel - but then you can do that with Quickbooks too.  Overall, most small businesses would be better off with Quickbooks.", "summary": "A pricy alternative to Quickbooks", "unixReviewTime": 1446681600}
{"overall": 4.0, "vote": "3", "verified": false, "reviewTime": "10 21, 2015", "reviewerID": "A18S2VGUH9SCV5", "asin": "B011I737WG", "reviewerName": "Margaux Paschke", "reviewText": "(3.5 STARS) I got this software for basic book keeping and it does that and a whole lot more.  This version includes the most options and allows for three users which was a primary concern for me.  Let me start by admitting that I do not have a background in accounting so the software was not as intuitive as I would have liked and I'm not using it for a small company but for a 40+ committee.  The options were amazing and it offered professional grade invoices and financial statements.  It can be set up to manage direct deposits, print checks and a whole host of small business needs (payroll, inventory, audits, etc.) that I do not require at this point.  This software is overkill for my purposes but would work well for a small to mid sized businesses.  I subtracted a star for the difficulty in installing the software and that some features require subscriptions (read payment) to provide complete function.", "summary": "Let me start by admitting that I do not have a background in accounting so the software was not as intuitive as I would have lik", "unixReviewTime": 1445385600}
{"overall": 3.0, "vote": "16", "verified": false, "reviewTime": "12 17, 2015", "reviewerID": "A250AXLRBVYKB4", "asin": "B011I737YE", "reviewerName": "ConsumerAdvocate (dakotad555) at (gmail) dot (com)", "reviewText": "The newest trend in software is to sell you a subscription rather than a piece of software that you own and may use as you like. What's the difference and why is it important? Allow me to explain:\n\nA subscription is like a lease. You pay a set amount of money either monthly or for one year and gain access to something (an apartment, a piece of software) and may use it for the agreed upon amount of time. Once the lease (or the subscription) is terminated, you LOSE your right to use said item. That might be fine for apartments, but much less so for software. You are beholden to the company that created the software forever. If they decide to STOP making the software, you lose your data, and even more importantly, your ability to access and use your previously collected data. Or at least you might, and that's a huge risk for something like accounting data. You might be stuck manually entering years worth of data by hand from printed reports (assuming you have them all).\n\nWhen you purchase something, you have several protected rights. One is the right to use what you purchased however you like and for as long as you like (fair use). You also have the right to sell that thing to someone else (First Sale doctrine). With a subscription you have neither of those things, and the lease or subscription holder can take your ability to use the software away from you any time they like. Perhaps they won't, but its an undeniable factor that must be taken into account.\n\nAll that said, SAGE and QUICKBOOKS use the same model, so you're not really going to have much choice but to have a subscription if you want a professional accounting software. That's sad, but true. It wasn't always this way, and maybe with enough consumer push back, it won't be this way in the future.", "summary": "SUBSCRIPTION BASED: You do not own this software", "unixReviewTime": 1450310400}
{"overall": 5.0, "verified": true, "reviewTime": "03 30, 2017", "reviewerID": "A12YN0X0CRN1AV", "asin": "B0123C60EW", "reviewerName": "Dora", "reviewText": "I downloaded this Corel PaintShop Pro X8 on one computer, and I purchased this disc from Amazon.  I recommend getting it this was.  For some reason it never works as well when downloaded. I have 3 different types of photo programs, and this is my favorite.", "summary": "Buy Corel PaintShop Pro X8 from  Amazon.", "unixReviewTime": 1490832000}
{"overall": 5.0, "verified": false, "reviewTime": "08 29, 2017", "reviewerID": "A1HF3OK0XXJ7JN", "asin": "B0123C648Y", "reviewerName": "AParkR", "reviewText": "I purchased the upgrade directly from Corel last year for just a little over $100.  I upgraded to Painter 2016 from Painter X3 because I liked the newer Particle and other Special FX brushes.  When I found out that I could download and utilize most of the Photoshop ABR brushes available online, that convinced me to take the plunge.  I'm glad Corel added this to Painter 2016, because I've been adding many different types of Special FX brushes since I purchased it.  I've lost cost of how many brushes I've downloaded, but let's just say that I'll never have to purchase any of the brushes Corel sells because I've found many variations on them and so much more.  Plus, I'll never have to worry about creating any \"custom\" brushes because I now actually have more than I'll realistically ever use AND THEN SOME!!!!  I've played around with many of them and have started utilizing some of them in a few recent illustrations.  Now, I can add many of the special effects that would've been either too time-consuming and labor-intensive to do from scratch.  Just like with Photoshop's Lens Flare, I have to constantly remind myself  that any effects I choose should serve the illustration, not overwhelm it (just for the record, I've found many ABR brush variations on the aforementioned Lens Flare, too).\n\nThe only negative is that Painter 2016 is slow to load when I initially click on it, no matter which of my laptops I use. After the first time, it boots up fairly quickly.\n\nOverall, I love Painter 2016 and I'm likely to stick with it until a later version comes along that's substantially better.", "summary": "Worth it for the ability to add Photoshop ABR brushes!!!!", "unixReviewTime": 1503964800}
{"overall": 1.0, "verified": true, "reviewTime": "03 11, 2018", "reviewerID": "A10CRW7XRJBJ2G", "asin": "B013LIFYRQ", "style": {"Format:": " CD-ROM"}, "reviewerName": "jjm", "reviewText": "Acronis serial number was not accepted by company", "summary": "true image Oh Ya", "unixReviewTime": 1520726400}
{"overall": 5.0, "verified": true, "reviewTime": "06 28, 2018", "reviewerID": "A34AN3NF8P7PJ", "asin": "B0144BWWTW", "reviewerName": "Reatha Carey", "reviewText": "It is here when I need it", "summary": "Five Stars", "unixReviewTime": 1530144000}
{"overall": 5.0, "verified": true, "reviewTime": "06 3, 2018", "reviewerID": "A2IAQL36OILN2S", "asin": "B0153V571W", "reviewerName": "G. Updike", "reviewText": "I don't use it a lot but when I do it does what I need.", "summary": "Works as advertised.", "unixReviewTime": 1527984000}
{"overall": 1.0, "verified": false, "reviewTime": "05 31, 2018", "reviewerID": "A24X9HGDWV2ZZH", "asin": "B0153V64V4", "reviewerName": "GGSM Mobile", "reviewText": "Excel:\nDoes not allow you to copy and paste sometimes. I later found out it's related to having many Excels open.\nClicking the lower edge of a cell will navigate to the end of the sheet.\nDoes not allow you to paste into visible cells only, despite having this setting selected.\nShortening long numbers by default\nDoes not save, unable to edit a cell. Freezes.\nConstantly freezes, unable to copy, close, or open anything. The only way out is to close all the windows and restart, or end task.\nMangles special characters and eff me over on more than a few occasions. Why would the default encoding be Western instead of UTF-8??\nReturning false positive in Conditional Formating when highlighting duplicate values.\nOpening a new window will minimize it (the new window)\nCan't analyze long numbers. Conditional Formatting will think that all long numbers are duplicates.\nAuto converts dashes used as bullet points into formulas.\nUseless Filter function when used on large set of data.\nScroll bars disappearing for no reason.\n\nOutlook:\nMinimizes a newly opened window.\nFolder pane disappears for no reason, unable to go back to Mail from Calendar.\nCannot search for emails using part of the senders domain, would have to provide the entire domain.\nIt updated and then it says \"this app can't run on your pc\"\nRun indexing in the middle of the day, preventing search results to fully return.\nCrashes constantly.\n\nWindows:\nFolders search boxes don't search after typing in and hitting Enter\nWhy the fk would all the windows be minized when I'm moving another window around?\nTaskbar doesn't work\nClick Start in windows 10 will give a \"Critical Error\" message, requiring the user to sign out.\nSleeps after 1 minute of inactivity although the sleep setting is 30 minutes on battery, and Never on power.", "summary": "Useless pile of software", "unixReviewTime": 1527724800}
{"overall": 5.0, "verified": true, "reviewTime": "04 27, 2018", "reviewerID": "A1D1NIU7AGSDJY", "asin": "B0153V64V4", "reviewerName": "3589", "reviewText": "MS Office is a great set of tools", "summary": "Great software", "unixReviewTime": 1524787200}
{"overall": 1.0, "verified": true, "reviewTime": "08 11, 2018", "reviewerID": "ACMXHJV1KCOSV", "asin": "B015724V9Q", "style": {"Platform:": " PC/Mac Download"}, "reviewerName": "68_Continental", "reviewText": "Despite turning off every setting somewhat indicative of notifications, I still get basically advertisements for other Norton products from the app and its plug-ins.  I didn't pay for software to be advertised to.  It's extremely annoying.", "summary": "What's with the ads?!", "unixReviewTime": 1533945600}
{"overall": 5.0, "verified": true, "reviewTime": "07 24, 2018", "reviewerID": "A10NC6ZVVMBHNH", "asin": "B015C9KOHM", "style": {"Platform:": " PC"}, "reviewerName": "John K", "reviewText": "Works well.  After several phone calls.  It works perfectly.  Trend Micro is the best internet security in the market IMHO.  Tried them all.  Least invasive and has kept viruses for years.", "summary": "Excellent Value", "unixReviewTime": 1532390400}
{"overall": 5.0, "verified": true, "reviewTime": "01 13, 2018", "reviewerID": "AY7Z0W9EKBCBB", "asin": "B015IHWAZW", "reviewerName": "Tina Musto", "reviewText": "good protection.. ladygamblertina@yahoo.com", "summary": "Five Stars", "unixReviewTime": 1515801600}
{"overall": 5.0, "verified": true, "reviewTime": "12 1, 2017", "reviewerID": "AOOWG6KYD32UJ", "asin": "B015IHWAZW", "reviewerName": "Harold Pont", "reviewText": "This software is the same as the 360 Total Security - Free Antivirus & Internet Security for PC 2017 [Download] also available on Amazon.  Both download the same installation from the same host.  These are great programs.  I use Advanced System Care from iobit.com too.  Somehow, this program disabled the Advanced System Care program.  Other than that.  I love it.", "summary": "Great program with only one incompatibility to report.", "unixReviewTime": 1512086400}
{"overall": 5.0, "verified": true, "reviewTime": "01 31, 2018", "reviewerID": "A377FI7BV0X32K", "asin": "B015MI2AYI", "reviewerName": "William Cashion", "reviewText": "good software", "summary": "Five Stars", "unixReviewTime": 1517356800}
{"overall": 1.0, "verified": true, "reviewTime": "02 13, 2017", "reviewerID": "A1NTUHB72MS4WS", "asin": "B015MI2AYI", "reviewerName": "dodybe", "reviewText": "didnt understand a bit of the rubbish", "summary": "One Star", "unixReviewTime": 1486944000}
{"overall": 5.0, "verified": true, "reviewTime": "06 28, 2018", "reviewerID": "A34AN3NF8P7PJ", "asin": "B015OY6WKS", "reviewerName": "Reatha Carey", "reviewText": "It is a helpful tool to have if you need it.", "summary": "Five Stars", "unixReviewTime": 1530144000}
{"overall": 5.0, "verified": true, "reviewTime": "03 21, 2018", "reviewerID": "A377FI7BV0X32K", "asin": "B015SWVD3M", "reviewerName": "William Cashion", "reviewText": "Works great", "summary": "Five Stars", "unixReviewTime": 1521590400}
{"overall": 2.0, "verified": true, "reviewTime": "11 30, 2017", "reviewerID": "A2DKUVUY6M48YF", "asin": "B015SWVD3M", "reviewerName": "Shilo Agee", "reviewText": "Was not what I expected", "summary": "Two Stars", "unixReviewTime": 1512000000}
{"overall": 5.0, "verified": true, "reviewTime": "04 6, 2018", "reviewerID": "A2ONJRZVX2MLVE", "asin": "B01617VO2S", "style": {"Platform:": " PC Download"}, "reviewerName": "Angela-Clare Pollard", "reviewText": "Easy to file your taxes correctly.", "summary": "Five Stars", "unixReviewTime": 1522972800}
{"overall": 3.0, "verified": true, "reviewTime": "07 22, 2017", "reviewerID": "A3ISA8LBB5P34E", "asin": "B01637RGG4", "style": {"Platform:": " Mac Download"}, "reviewerName": "cm", "reviewText": "It's ok for a simple return, but it could be better.", "summary": "but it could be better.", "unixReviewTime": 1500681600}
{"overall": 5.0, "verified": true, "reviewTime": "04 6, 2018", "reviewerID": "A2ONJRZVX2MLVE", "asin": "B01637RHBI", "style": {"Platform:": " PC Download"}, "reviewerName": "Angela-Clare Pollard", "reviewText": "Easy to file your taxes correctly.", "summary": "Five Stars", "unixReviewTime": 1522972800}
{"overall": 5.0, "verified": true, "reviewTime": "06 20, 2018", "reviewerID": "A3RNXWG0J64Z9Z", "asin": "B0169RGE7U", "style": {"Platform:": " PC Disc"}, "reviewerName": "LJ", "reviewText": "works great, easy to capture videos and save", "summary": "Video Capture Software", "unixReviewTime": 1529452800}
{"overall": 4.0, "verified": true, "reviewTime": "04 2, 2018", "reviewerID": "A1THNW9Y672UWG", "asin": "B01AC3ZAHW", "style": {"Platform:": " PC"}, "reviewerName": "IRON GIGANTIS", "reviewText": "my go to photo editing software. works with windows 10 pro 64bit.", "summary": "my go to photo editor", "unixReviewTime": 1522627200}
{"overall": 1.0, "verified": true, "reviewTime": "11 24, 2017", "reviewerID": "A1ZOIGQHW7FPT2", "asin": "B01AC3ZAHW", "style": {"Platform:": " PC"}, "reviewerName": "Thorvald", "reviewText": "I have been a big supporter of Corel products -- VideoStudio and PaintShop Pro -- since their earliest versions. They generally do what the more expensive software does but more easily and with more user-friendly filters and frills. Despite their aiming recent versions more at the auto-generate projects for amateurs to create fancy projects quickly, the Corel software still offers the features and function the pros want to product videos and graphics.\n\nBUT, the recent versions, including this one currently infesting my computers, have an added thrill: THEY COME WITH POPUP ADVERTISEMENTS!  Goodie. Now whatever I'm doing I get obnoxious, endless, impossible to remove Corel ads popping up over everything. Often they have no X in the corner to close them. There is no way to stop them. I'm a computer person from way back and I cannot stop these things. I've done everything I have found in setting to stop them in the software settings, including not permitting them from the original install, and they are still there.\n\nEvil. Horrible. And Corel just lost a lifetime customer.", "summary": "Endless Spam and Popups - Corel has gone to the Dark Side", "unixReviewTime": 1511481600}
{"overall": 4.0, "verified": true, "reviewTime": "03 3, 2017", "reviewerID": "AV69BQQR8VCQA", "asin": "B01AC3ZA7C", "reviewerName": "Hap", "reviewText": "Best program for the price that I could find and I took a week to check out as many programs and reviews of programs as I could", "summary": "Best program for the price that I could find and ...", "unixReviewTime": 1488499200}
{"overall": 5.0, "verified": true, "reviewTime": "03 1, 2018", "reviewerID": "A3PGN4ZXMQRSYH", "asin": "B01DEG0SGC", "reviewerName": "Amazon Customer", "reviewText": "Arrived as described.  I was pleased with purchase", "summary": "I was pleased with", "unixReviewTime": 1519862400}
{"overall": 1.0, "verified": true, "reviewTime": "11 30, 2017", "reviewerID": "A2DKUVUY6M48YF", "asin": "B01E6C5D1S", "reviewerName": "Shilo Agee", "reviewText": "Was not what I expected", "summary": "Was not what I expected", "unixReviewTime": 1512000000}
{"overall": 4.0, "verified": true, "reviewTime": "11 21, 2016", "reviewerID": "A1MOLMEBRO23PR", "asin": "B01E6C5D1S", "reviewerName": "Daniel Young", "reviewText": "great buy", "summary": "Four Stars", "unixReviewTime": 1479686400}
{"overall": 4.0, "verified": true, "reviewTime": "11 14, 2016", "reviewerID": "A1RHJX6OA0O9KQ", "asin": "B01E6C5D1S", "reviewerName": "Kevin C", "reviewText": "The product itself is quite good, in depth fixes, easy auto features.  The company REALLY wants you  to add time to your subscription and the pop ups do become annoying.  Especially since I have 1 1/2 years left to go on mine still.  The upgrades are included in your subscription so you do NOT need to add time to get them.", "summary": "They put out a good product...all they need is less marketing!", "unixReviewTime": 1479081600}
{"overall": 4.0, "verified": true, "reviewTime": "10 1, 2016", "reviewerID": "A20QR509GXKL2A", "asin": "B01E6C5D1S", "reviewerName": "larry johnson", "reviewText": "ok", "summary": "Four Stars", "unixReviewTime": 1475280000}
{"overall": 4.0, "vote": "2", "verified": false, "reviewTime": "08 30, 2016", "reviewerID": "A35SZBPM3WCB4", "asin": "B01FFVDY9M", "style": {"Platform:": " Key Card"}, "reviewerName": "Feejo", "reviewText": "When you get started and you eard of lightroom and did not know how to go around with (LR is very complex) you might start to look around for something that does the same thing. Or if you have enough of LR. There is a nice tutorial with a pro out there. If you are the kind to do just a couple of adjustment like contrast, sharpening and exposure, you don't need LR. ASP do that and more. It does not do everything LR does, like if you are a die had vignetting, they have it. But right now there is no white vignetting. But there is alway's a work around, you can export your picture into something like Photoshop elements or Paintshop Pro. Many users can be just happy with it, but did not eard of Aftershoot pro. It's still a young software, but they listen their customers. If you don't want to invest 10$ per month for Lightroom photoshop all your life, get into ASP. I don'T know about the raw conversion, even on Lightroom not everybody is happy about it. I shoot JPG.\nASP have presets also. Some tools are incomplete like Cropping. But some tools are faster to use than LR in the cropping. I am all about cropping, I think LR is incomplete, I would eventually create my own crop tool as plugin for ASP and would be happy with it. You can actually have a programmer making plugins for you to do what you want with a software like ASP, but people don't think about it.", "summary": "Very nice, read the manual to get everything out of it.", "unixReviewTime": 1472515200}
{"overall": 4.0, "vote": "7", "verified": false, "reviewTime": "07 26, 2016", "reviewerID": "A3EK2KTYHJCPB9", "asin": "B01FFVDY9M", "style": {"Platform:": " Key Card"}, "reviewerName": "Brian R.", "reviewText": "I feel like this software is a good balance of power and simplicity.  I've been a Photoshop Elements user for quite a number of years.  I've always been put off by the way you have to import files and how editing was always a bit of a separate task from editing and cataloging.  AfterShot Pro combines both really well.  It lets you use your native file folder organization directly yet you can still create custom \"collections\" of shots from multiple folders.  Although it has plenty of tagging and keyword capabilities, they aren't quite as straightforward nor are they the main focus in this application.\n\nEditing photos is pretty easy with workflow tabs and plenty of easy 1-click types of adjustments.  Of course you can customize the settings in many of these.  As you probably know, software such as AfterShot has less of a focus on preset filters, effects and layers and more on the basic adjustments of lighting, color cast, sharpening and noise reduction.  There's also presets for lens corrections for specific camera models, and additional profiles can be downloaded for free.  Photo effect filter sets can also be purchased and downloaded.  If you want to create your own combinations, these can be set, saved, and then used later - even on multiple files.\n\nThat brings me to the next feature set which is really easy and powerful batch editing.  By saving presets, or even choosing the settings from a single picture you've already edited in AfterShot, you can reapply those same edits and adjustments to other photos.  Every filter and adjustment is saved with the photo and you always have access to this information.\n\nThe one thing that does bug me and the main reason for only 4 stars is that the interface can be kind of cluttered and the photo space small on a 1440x900 monitor.  I highly recommend something with more resolution.  Also, every time I applied a filter, even checking or unchecking a preset, I would have to mouse over the image, make a mouse click, or press a keyboard button for the image to redraw.  This can be pretty annoying when you're trying to fine tune sharpening or noise reduction and making lots of small incremental changes.", "summary": "Great workflow and balance of power and simplicity.", "unixReviewTime": 1469491200}
{"overall": 5.0, "verified": false, "reviewTime": "07 17, 2016", "reviewerID": "A5U5T6EWH90O0", "asin": "B01FFVDY9M", "style": {"Platform:": " Key Card"}, "reviewerName": "Lauri", "reviewText": "I am a total amateur when it comes to editing, but needed to try something for editing the photos I take for my business.\n\nThis software was a quick and easy download.  Once downloaded, I was able to start using it pretty quickly, the learning curve was one that I could understand without too much trial and error.\n\nI take many photos of different items in the same location, so when I need to edit, it's generally the same thing which needs editing, this software is perfect for that.  Now I can fix multiple photos at one time, saving a lot of time!\n\nThe price is great if you're not sure about the program, not a huge expense like many others out there.\n\nFor me, and my level of expertise, or lack of it, this program fits the bill!", "summary": "Works great for my purposes!", "unixReviewTime": 1468713600}
{"overall": 4.0, "verified": false, "reviewTime": "07 16, 2016", "reviewerID": "A1E50L7PCVXLN4", "asin": "B01FFVDY9M", "style": {"Platform:": " Key Card"}, "reviewerName": "Colinda", "reviewText": "When I ordered this it was listed as Photo Editing Software with a description emphasizing the ways it can fix your images. After watching Corel's introductory video and trying the software, I would classify it as a file management tool that happens to perform editing tasks. In that repect, it is similar to Lightroom. It is not as powerful as Lightroom but it is affordable and does not require a subscription.\n\nPersonally I will just go back to using Adobe Bridge, which I got with the last Photoshop version that was sold before they went to the subscription model. Bridge is under-appreciated as a file manager and offers RAW editing features even for JPEGs, and since I have used it for years I am comfortable with it. But if you don't want to make a heavy investment and you handle a high volume of files, AfterShot Pro is worth considering. It is not hard to learn, especially if you watch the videos on Corel's website.\n\nI downloaded this software over a wi-fi connection. It was easy to install on my Macbook.\n\nFor me, the editing tools seemed basic compared to Photoshop. But Aftershot Pro does not take a long time to learn so you may prefer it if you are not a Photoshop user.", "summary": "File Management Software with Basic Editing Capability", "unixReviewTime": 1468627200}
{"overall": 3.0, "verified": false, "reviewTime": "06 17, 2017", "reviewerID": "AVU1ILDDYW301", "asin": "B01HAP3NUG", "reviewerName": "G. Hearn", "reviewText": "This software has SO much going on.  Theres a plethora of things you can do with it. . . which is GREAT.  .. but. . . if you're a beginner, then you're probably going to be VERY overwhelmed.  Pinnacle offers tutorials. .. but for a fee.  Fortunately, there are several very good tutorials to be found online for free.  But I have to say. . . This is not the easiest software to use for a novice.  You have to be willing to put in the time-and-effort.  Ive used it for quite simple things, and it works, but its time-consuming.  Make sure you look at the differences between the three different software options.  The Plus software (this listing) has just about everything one could need. . . but. . . . if you need 360 video, then youll need to check-out the Ultimate software.", "summary": "Might not be for the \"novice\"", "unixReviewTime": 1497657600}
{"overall": 4.0, "verified": false, "reviewTime": "01 24, 2017", "reviewerID": "A2LW5AL0KQ9P1M", "asin": "B01HAP3NUG", "reviewerName": "Dr. E", "reviewText": "I have used both more complex and less complex software. And, I always return to Pinnacle Studio. For those who have used similar software in the past, it is fairly intuitive and one isn't paying for a truckload of \"bells and whistles\" one will never use. I really like that aspect. However, I did get a different perspective when my brother attempted to use it. He tinkered with it for about an hour and walked away frustrated. He said that he wished it were more friendly to the new user. Looking at this through his eyes, I can see that. He ultimately purchased&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Cyberlink-PowerDirector-15-Ultra/dp/B01LEZN03I/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Cyberlink PowerDirector 15 Ultra</a>&nbsp;for his home computer and has had tremendous luck (and it does have a bunch of really cool features that I enjoyed playing with).\n\nSo, I think it may be about your level of familiarity. For me, Pinnacle Studio has always been a favorite; however, for the new-user, maybe PowerDirector is best for a quick start!", "summary": "Great, Inexpensive Software for Those Who Have Used Similar Programs ...", "unixReviewTime": 1485216000}
{"overall": 3.0, "verified": false, "reviewTime": "06 14, 2018", "reviewerID": "AZ515FFZ7I2P7", "asin": "B01HAP47PQ", "style": {"Platform:": " PC Disc"}, "reviewerName": "Jerry Jackson Jr.", "reviewText": "Pinnacle Studio 20 Ultimate is a perfectly serviceable application for editing videos and creating video content for YouTube or burning DVD's for personal use. That said, the interface is troubled by poor design: all the key features are there, but the controls aren't nearly as intuitive as they should be and were \"overthought\" to the point the controls became complicated.\n\nIn other words, I found myself constantly struggling to figure out how to perform basic video and audio edits ... not because the features were missing but because I had to figure out what the developer/programmer mistakenly thought would be the most intuitive way for a user to perform that task.", "summary": "Gets the job done ... but not as easy as it should be.", "unixReviewTime": 1528934400}
{"overall": 4.0, "verified": false, "reviewTime": "04 16, 2018", "reviewerID": "A2WPL6Y08K6ZQH", "asin": "B01HAP47PQ", "style": {"Platform:": " PC Disc"}, "reviewerName": "Narut Ujnat", "reviewText": "A program that is fairly easy to use and provides some good results.\n\nI have not really experienced issues with the use of the program, but I think many of the issues others have encountered are related to computers that don't have good graphics cards and/or memory since video/photo programs are intense computer resource hogs.  With a good computer there doesn't seem to be any real issues.\n\nThe effects and features have a bit of a learning curve, but I believe any savvy computer user can learn with some effort.", "summary": "Good overall program.", "unixReviewTime": 1523836800}
